baseCaseCoagFoam_Rectangle/0/fluidPhase_S2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      fluidPhase_S2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/inputParameters"

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    inletVessel
    {
        type            codedFixedValue;
        value           uniform $S2_IC;
        name            rampS2_Inlet;

        code
        #{
            // wall shear rate inverse seconds
            const scalar S2_IC
                = readScalar
                    (
                        db().lookupObject<IOdictionary>
                        (
                            "inputParameters"
                        ).lookup("S2_IC")
                    );

                    const scalar t_start
                    = readScalar
                        (
                            db().lookupObject<IOdictionary>
                            (
                                "inputParameters"
                            ).lookup("t0_chem")
                        );
                const scalar t_stop
                    = readScalar
                        (
                            db().lookupObject<IOdictionary>
                            (
                                "inputParameters"
                            ).lookup("tf_chem")
                        );
                scalar m = S2_IC / (t_stop - t_start);
    
                operator==
                (
                    max(
                            0.0, 
                            min(S2_IC, m*this->db().time().value() - m*t_start)
                        )
                );
        #};

    }
    
    outletVessel
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
    
    injuryWalls
    {
        type            zeroGradient;
    }
    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
