baseCaseCoagFoam_Rectangle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inletVessel
    {
        type            patch;
        nFaces          32;
        startFace       8032;
    }
    outletVessel
    {
        type            patch;
        nFaces          32;
        startFace       8064;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          208;
        startFace       8096;
    }
    injuryWalls
    {
        type            patch;
        nFaces          48;
        startFace       8304;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8192;
        startFace       8352;
    }
)

// ************************************************************************* //
