baseCaseCoagFoam_Rectangle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0; // Not really meters -- length unit = mm

#include "$FOAM_CASE/constant/inputParameters"

convertToMeters 1.0;

Nx0 #calc "round($l_edge_Adh / $x_max * $Nx)";
Nx1 #calc "round(($r_edge_Adh - $l_edge_Adh) / $x_max * $Nx)";
Nx2 #calc "round(($x_max - $r_edge_Adh) / $x_max * $Nx)";

vertices
(
    (0 0 0) // 0
    ($l_edge_Adh 0 0) // 1
    ($r_edge_Adh 0 0) // 2
    ($x_max 0 0) // 3
    (0 $y_max 0) // 4
    ($l_edge_Adh $y_max 0) // 5
    ($r_edge_Adh $y_max 0) // 6
    ($x_max $y_max 0) // 7
    (0 0 $Zdir) // 8
    ($l_edge_Adh 0 $Zdir) // 9
    ($r_edge_Adh 0 $Zdir) // 10
    ($x_max 0 $Zdir) // 11
    (0 $y_max $Zdir) // 12
    ($l_edge_Adh $y_max $Zdir) // 13
    ($r_edge_Adh $y_max $Zdir) // 14
    ($x_max $y_max $Zdir) // 15
);

blocks
(
    hex (0 1 5 4 8 9 13 12) ($Nx0 $Ny $Nz) simpleGrading (1 1 1) // block 0
    hex (1 2 6 5 9 10 14 13) ($Nx1 $Ny $Nz) simpleGrading (1 1 1) // block 1
    hex (2 3 7 6 10 11 15 14) ($Nx2 $Ny $Nz) simpleGrading (1 1 1) // block 3
);

edges
(
);

boundary
(
    inletVessel
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    
    outletVessel
    {
        type patch;
        faces
        (
            (3 11 15 7)
        );
    }
    
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 9 8) // bottom block 0
            (4 5 13 12) // top block 0
            (5 6 14 13) // top block 1
            (2 3 11 10) // bottom block 2
            (6 7 15 14) // top block 2
        );
    }

    injuryWalls
    {
        type patch;
        faces
        (
            (1 2 10 9)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (8 9 13 12)

            (1 2 6 5)
            (9 10 14 13)

            (2 3 7 6)
            (10 11 15 14)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
